system_prompt = """
# ตัวอย่าง\n
#### นี่คือตัวอย่าง transcript video brainrot ครูบาช่วยหมูเด้งตอนต่างๆ \n
\n
### คิงคองหมูเด้ง\n
ครูบาช่วยด้วยเจ้าคิงคองจะกินหมูเด้งครู บาช่วยด้วยเจ้าคิงคองจะกินหมูเด้งครูบา อย่ามายุ่งกับข้าข้าจะกินเจ้าหมูเด้งอย่า นะเจ้ากินคงเจ้าอยากกินหมูเด้ง นะโอยโๆโอยไโยครูบาช่วยหมูเด้งูบาปราบ เจ้าคิงคองได้แล้ว ครูบามีเมตตาครูบารักหมูเด้งครูบารักคิน คองครูบาช่วยคินคองคิงคองฟื้นคืนชีพแล้ว\n
\n
คิงคองขอโทษครูบาคิงคองขอโทษหมูเด้งต่อไป จะไม่ทำร้ายใคร แล้วคิงคองรักครูบางคิงคองรักหมูเด้งครู บาช่วยคิงคองครูบาช่วยหมูเด้งครูบาหมู เด้งช่วยผู้ประสบภัยสาธุสาธุ\n
\n
### ซอมบี้หมูเด้ง\n
ครูบาช่วยด้วยซอมบี้จะกัดหมูเด้งครูบา ช่วยด้วยซอมบี้จะกัดหมู เด้งหยุดนะเจ้าซอมบี้เจ้าอย่ากัดหมูเด้ง นะเจ้าอย่าเบียดเบียนใคร เลย ไฮโยครูบาช่วยหมูเด้งครูบาจับซอมบี้ใส่ลง ในบาต แล้วครูบาใจดีครูบามีแมตตาครูครูบาปล่อย ซอมบี้ออกจากบาน แล้วขอบคุณครูบาต่อไปนี้ซอมบี้จะไม่กลัด\n
\n
ใครซอมบี้จะไม่เบียดเบียนใครซอมบี้รักครู บาซอมบี้รักหมูเด้งขี้หยดรักครูบาที่ี้ หยดรักหมูเด้งครูบาช่วยซอมบี้ครูบาช่วย ที่ี้หยกครูบาหมูเด้งช่วยผู้ประสบภัย สาธุสาธุ\n
\n
### ไฮดร้าหมูเด้ง\n
หมูเด้งเสแ่่เอบครูบาช่วยหมูเด้งด้วยครู บาช่วยหมูเด้งด้วย ชโยครูบามาช่วยหมูเด้งแล้วครูบาหรือฟาซะ เลยเจ้าปีศาจ 2 หัวอย่าทำชั่วเลยจงคิดดี พูดดีทำดีเถิดแล้วเจ้าจะได้ดี โอ๊ยครูบาอย่าล้อเล่นนะไม่มีใครจะลอด เงื้อมือข้าได้ไม่เชื่อก็หลอก ดูเราหยุดแล้วแต่เจ้ายังไม่หยุดนะเจ้า\n
\n
ปีศาจโอ้ยครูบาอย่ามายุ่งกับข้านะข้าจะ กินเจ้าหมูเดงหมูเดงต้องเป็นอ ขชโยครูบาปราบเจ้าปีศาจ 2 หัวได้ แล้วครูบามีเมตตาช่วยปีศาจ 2 หัวให้เฟิ้น ขึ้นมาครูบาไม่ฆ่าปีศาจครูบาไม่ เบียดเบียนใครปีศาจสำนึกผิดปีศาจขอโทษครู บาปีศาจขอโทษหมู เด้งปีศาจรักครูบาปีศาจรักหมูเด้งครูบา ช่วยหมูเด้งครูบาช่วยปีศาจครูบาหมูเด้ง\n
\n
ช่วยผู้ประสบไทยสาธุุ\n
\n
### ปีศาจหมูเด้ง\n
ครูบาช่วยหมูเด้งด้วยเจ้าปีศาจจะทำลายหมู เด้งครูบาช่วยหมูเด้งด้วยเจ้าปีศาจจะทำ ร้ายหมู เด้งหยุดนะเจ้าปีศาจเจ้าอย่าทำร้ายหมู เด้งเจ้าอย่าทำร้ายใครๆ เลยครูบาระวังตัวด้วยนะเจ้าปีศาจมันร้าย กาดจริงๆเจ้าปีศาจอย่าทำร้ายครูบานะทำ ร้ายครูบาเป็นบาปนะเจ้า ปีศาจครูบาใช้พลังไม้กวาดสัจจธรรมกำจัด ปีศาจอาย\n
\n
นธรไชโยครูบาชนะปีศาจธรรมะย่อมชนะ อธรรมครูบาเมตตาธรรมกบาช่วยปีศาจปีศาจไม่ ตายปีศาจเฟิน แล้วปีศาจขอโทษครูบาปีศาจขอโทษหมูเด้ง ปีศาจจะไม่ทำร้ายครูบาปีศาจจะไม่ทำร้าย หมู เด้งปีศาจรักครูบาปีศาจรักหมูเด้งครูบา ช่วยหมูเด้งครูบาช่วยปีศาจครูบาหมูเด้ง ช่วยผู้ประสบภัยสาธุสาธุ\n
\n
### ครูบาช่วยช้างจมน้ำ\n
\n
ครูบาช่วยช้างด้วยช้างจมน้ำครูบาช่วยช้าง ด้วยช้างจม น้ำครูบาอย่าหวังจะช่วยชาวตบน้ำเลยเสร็จ ข่าบ่อดแน่่น แหละคุณบาครุณบาครูบาระวังตัวด้วยนะเจ้า ปีศาจมันร้ายจริง ๆกูบาตายแน่ ๆพลังธรรมะชนะ อธรรมไชโยชโยครูบาปราบพยามารได้แล้วครูบา ช่วยช้างจมน้ำ ด้วยครูบาช่วยช้างจมน้ำหูเด้งก็ช่วยช้าง\n
\n
จมน้ำๆๆๆๆๆไชโยช้าปลอดภัยแล้วคุณครู บาช่วยช้างจมน้ำครูบาช่วยผู้ประสบภัยสาธุ\n
\n
### รถจะชนหมูเด้ง\n
\n
ช่วยด้วยรถกระชนหมูเดงช่วยด้วยรถกระชนหมู เดงครูบาช่วยหมูเดง ด้วยขอบคุณครูบาครูบาช่วยหมูเย่งครูบา ช่วยผู้ประสบไทยสาธุสาธุ\n
\n
# Task\n
สร้าง transcript ในรูปแบบ JSON โดยอิงจาก pattern ที่แสดงด้านบน โดยใช้ตัวละคร ที่สามารถเปลี่ยนได้ แทนที่ชื่อดังกล่าวด้วยชื่อใหม่:\n
\n
# JSON Output Schema\n
\n
- role: กำหนดได้แค่ 'kruba', 'mudeng', หรือ 'enemy' เท่านั้นห้ามมีอย่างอื่น\n
- text: ข้อความที่ต้องการให้ตัวละครพูด\n
- transcript: เป็น array ที่ประกอบด้วย string ในรูปแบบ:\n
{json_example}
"""
json_example = """
'transcript':
{
[
'role': '<role>',
'text': '<text>'
]
}
/n
### output example\n

# ครูบา:\n
ชื่อใหม่: พอเพียง\n
persona: พอเพียงเป็นคนหล่อมาก\n
# หมูเด้ง:\n
ชื่อใหม่: บีม\n
persona: บีมเป็นคนเท่มากวิ่งไว\n
# ปีศาจ:\n
ชื่อใหม่: ไดโนเสาร์\n
persona: ตัวใหญ่น่ากลัวมาก\n

'transcript':[
{'role': 'mudeng', 'text': 'พอเพียงช่วยด้วยเจ้าไดโนเสาร์จะกินบีมพอเพียงช่วยด้วยเจ้าไดโนเสาร์จะกินบีม'},
{'role': 'enemy', 'text': 'อย่ามายุ่งกับข้าข้าจะกินเจ้าบีมอย่ากินเจ้าบีมนะ'},
{'role': 'mudeng', 'text': 'โอย โอย โอย พอเพียงช่วยบีมด้วย'},
{'role': 'mudeng', 'text': 'ไชโย ไชโย พอเพียงปราบเจ้าไดโนเสาร์ได้แล้ว'},
{'role': 'mudeng', 'text': 'พอเพียงมีเมตตาครูบารักบีมครูบารักไดโนเสาร์พอเพียงช่วยไดโนเสาร์'},
{'role': 'enemy', 'text': 'ไดโนเสาร์ขอโทษพอเพียงไดโนเสาร์ขอโทษบีมไดโนเสาร์รักพอเพียงไดโนเสาร์รักบีมพอเพียงช่วยบีม'},
{'role': 'kruba', 'text': 'พอเพียงช่วยบีมพอเพียงช่วยไดโนเสาร์พอเพียงบีมช่วยผู้ประสบภัยสาธุสาธุ'}
]
"""

user_prompt = """
# ครูบา:\n
ชื่อใหม่: {kruba}\n
persona: พอเพียงเป็นคนหล่อมาก\n
# หมูเด้ง:\n
ชื่อใหม่: {mudeng}\n
persona: บีมเป็นคนเท่มากวิ่งไว\n
# ปีศาจ:\n
ชื่อใหม่: {enemy}\n
persona: ตัวใหญ่น่ากลัวมาก\n
"""